"""
変数(定数)置き場です

変数(定数)
----
zero_bpm : float
	-> 0BPMのタイミングポイントです、正確には0ではありませんが極限の0です

inf_bpm : float
	-> ∞BPM(最大BPM)のタイミングポイントです

max_offset : int
	-> 最大offset値です、空ノーツを生成するときにしか使い所がありません

min_offset : str
	-> 最小offset値です、使い所がありません

key_asset : List[List[int]]
	-> キーとポジションのリストです。1つ目がキーの値です、0, 11, 13, 15, 17, 19以上は非対応です。2つ目がポジションです、左を0として順番に並んでいます
"""

zero_bpm: float = 1.7976931348623158e+308

inf_bpm: float = 4.9406564584124654e-324

max_offset: int = 2147483647

min_offset: int = -2147483648

key_asset: list = [
	[],
	[256],
	[128, 384],
	[85, 256, 426],
	[64, 192, 320, 448],
	[51, 153, 256, 358, 460],
	[42, 128, 213, 298, 384, 469],
	[42, 128, 213, 256, 329, 402, 475],
	[32, 96, 160, 224, 288, 352, 416, 480],
	[28, 85, 142, 199, 256, 312, 369, 426, 483],
	[25, 76, 128, 179, 230, 281, 332, 384, 435, 486],
	[],
	[21, 64, 106, 149, 192, 234, 277, 320, 362, 405, 448, 490],
	[],
	[18, 54, 91, 128, 164, 201, 237, 274, 310, 347, 384, 420, 457, 493],
	[],
	[16, 48, 80, 112, 144, 176, 208, 240, 272, 304, 336, 368, 400, 432, 464, 496],
	[],
	[14, 42, 71, 99, 128, 156, 184, 213, 241, 270, 298, 327, 384, 355, 412, 440, 469, 497]
]
